# Creating Vectors

In [1]:
x <- c(0.5, 0.6) # numeric
y <- c(TRUE, FALSE) ## Logical
z <- c("a", "b", "c") #Character

## Explicit Coercion

In [5]:
x <- 0:6
class(x)

[1] "integer"

In [6]:
as.numeric(x)

[1] 0 1 2 3 4 5 6

In [7]:
as.logical(x)

[1] FALSE  TRUE  TRUE  TRUE  TRUE  TRUE  TRUE

In [8]:
as.character(x)

[1] "0" "1" "2" "3" "4" "5" "6"

## Matrices

In [9]:
m <- matrix(nrow=2, ncol=3)
m

     [,1] [,2] [,3]
[1,] NA   NA   NA
[2,] NA   NA   NA

In [10]:
dim(m)

[1] 2 3

In [11]:
attributes(m)

$dim
[1] 2 3

Matrices are constructed columnwise

m <- matrix(1:6, nrow=2, ncol=3)
m

matrix can also be constructed from Vectors using the dim() command

In [13]:
m <- 1:10
m

 [1]  1  2  3  4  5  6  7  8  9 10

In [15]:
dim(m) <- c(2,5)
m

     [,1] [,2] [,3] [,4] [,5]
[1,] 1    3    5    7     9
[2,] 2    4    6    8    10

matrices can be created using column binding and row binding

In [16]:
x <- 1:3
y <- 10:12
cbind(x,y)

     x y
[1,] 1 10
[2,] 2 11
[3,] 3 12

In [17]:
rbind(x,y)

  [,1] [,2] [,3]
x  1    2    3
y 10   11   12

## Factors

Factors are used to represent categorical data and can be unordered or ordered. One can think of
a factor as an integer vector where each integer has a label. Factors are important in statistical
modeling and are treated specially by modelling functions like lm() and glm().
Using factors with labels is better than using integers because factors are self-describing. Having a
variable that has values “Male” and “Female” is better than a variable that has values 1 and 2.
Factor objects can be created with the factor() function.

In [18]:
x <- factor(c("Yes","Yes","No","Yes","No"))
x

[1] Yes Yes No  Yes No
Levels: No Yes

In [19]:
levels(x)

[1] "No"  "Yes"

In [21]:
table(x)

x
 No Yes
  2   3

Often factors will be automatically created for you when you read a dataset in using a function like
read.table(). Those functions often default to creating factors when they encounter data that look
like characters or strings.
The order of the levels of a factor can be set using the levels argument to factor(). This can be
important in linear modelling because the first level is used as the baseline level.

In [23]:
x <- factor(c("Yes","Yes","No","Yes","No"), levels=c("Yes","No"))
levels(x)

[1] "Yes" "No"

## Missing Values

Missing values are denoted by NA or NaN for q undefined mathematical operations.
 is.na() is used to test objects if they are NA
• is.nan() is used to test for NaN
• NA values have a class also, so there are integer NA, character NA, etc.
• A NaN value is also NA but the converse is not true

In [24]:
# create a vector with NAs in it
x <- c(1,2,NA,10,3)
# return logical vector indicating which elements are NA
is.na(x)

[1] FALSE FALSE  TRUE FALSE FALSE

## Data Frames

In [25]:
x <- data.frame(f00=1:4, bar=c(T,T,F,F))
x

  f00 bar
1 1    TRUE
2 2    TRUE
3 3   FALSE
4 4   FALSE

In [26]:
nrow(x)
ncol(x)

[1] 4

[1] 2

## Names

In [27]:
x <- 1:3
names(x)

NULL

In [28]:
names(x) <- c("New York", "Seattle", "Los Angeles")
x

   New York     Seattle Los Angeles
          1           2           3

## Reading Data Files with read.table()

## Subsetting a Vector

In [30]:
x <- c("a","b","c","c","d","a")
x[1] # first element
x[2]  # second element

[1] "a"

[1] "b"

In [31]:
x[1:4]  # first to 4th element

[1] "a" "b" "c" "c"

In [33]:
u <- x > "a"
u

[1] FALSE  TRUE  TRUE  TRUE  TRUE FALSE

## Removing NA values

In [34]:
x <- c(1, 2, NA, 4, NA, 5)
bad <- is.na(x)
print(bad)

[1] FALSE FALSE  TRUE FALSE  TRUE FALSE

In [35]:
x[!bad]

[1] 1 2 4 5

In [36]:
head(airquality)

  Ozone Solar.R Wind Temp Month Day
1 41    190      7.4 67   5     1
2 36    118      8.0 72   5     2
3 12    149     12.6 74   5     3
4 18    313     11.5 62   5     4
5 NA     NA     14.3 56   5     5
6 28     NA     14.9 66   5     6

In [38]:
# we can use complete.cases on dataframes to eliminate missing values which returns logicals
good <- complete.cases(airquality)
head(airquality[good,])

  Ozone Solar.R Wind Temp Month Day
1 41    190      7.4 67   5     1
2 36    118      8.0 72   5     2
3 12    149     12.6 74   5     3
4 18    313     11.5 62   5     4
7 23    299      8.6 65   5     7
8 19     99     13.8 59   5     8

## Vectorized operations

Many operations in R are vectorized, meaning that operations occur in parallel in certain R objects.
This allows you to write code that is efficient, concise, and easier to read than in non-vectorized
languages.

In [40]:
x <- 1:4
y <- 6:9
z <- x+y
z

[1]  7  9 11 13

In [41]:
x > 2

[1] FALSE FALSE  TRUE  TRUE

## Managing DataFrames with the DPLYR package

Some of the key “verbs” provided by the dplyr package are
1. select: return a subset of the columns of a data frame, using a f lexible notation
2. filter: extract a subset of rows from a data frame based on logical conditions
3. arrange: reorder rows of a data frame
4. rename: rename variables in a data frame
5. mutate: add new variables/columns or transform existing variables
6. summarise / summarize: generate summary statistics of different variables in the data frame,
possibly within strata
7• %>%: the “pipe” operator is used to connect multiple verb actions together into a pipeline

## Common dplyr Function Properties

All of the functions that we will discuss in this Chapter will have a few common characteristics. In
particular,
1. The first argument is a data frame.
2. The subsequent arguments describe what to do with the data frame specified in the first
argument, and you can refer to columns in the data frame directly without using the $ operator
( just use the column names).
3. The return result of a function is a new data frame
4. Data frames must be properly formatted and annotated for this to all be useful. In particular,
the data must be tidy⁵². In short, there should be one observation per row, and each column
should represent a feature or characteristic of that observation.

In [42]:
library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [43]:
chicago <- readRDS("chicago.rds")
dim(chicago)

[1] 6940    8

In [45]:
# display structure of dataFrame
str(chicago)

'data.frame':	6940 obs. of  8 variables:
 $ city      : chr  "chic" "chic" "chic" "chic" ...
 $ tmpd      : num  31.5 33 33 29 32 40 34.5 29 26.5 32.5 ...
 $ dptp      : num  31.5 29.9 27.4 28.6 28.9 ...
 $ date      : Date, format: "1987-01-01" "1987-01-02" ...
 $ pm25tmean2: num  NA NA NA NA NA NA NA NA NA NA ...
 $ pm10tmean2: num  34 NA 34.2 47 NA ...
 $ o3tmean2  : num  4.25 3.3 3.33 4.38 4.75 ...
 $ no2tmean2 : num  20 23.2 23.8 30.4 30.3 ...

The select() function can be used to select columns of a data frame that you want to focus on.
Often you’ll have a large data frame containing “all” of the data, but any given analysis might only
use a subset of variables or observations. The select() function allows you to get the few columns
you might need.
Suppose we wanted to take the first 3 columns only. There are a few ways to do this. We could for
example use numerical indices. But we can also use the names directly.

In [46]:
names(chicago)[1:3]

[1] "city" "tmpd" "dptp"

In [48]:
subset <- select(chicago, city:dptp)
head(subset)

  city tmpd dptp
1 chic 31.5 31.500
2 chic 33.0 29.875
3 chic 33.0 27.375
4 chic 29.0 28.625
5 chic 32.0 28.875
6 chic 40.0 35.125

Note that the : normally cannot be used with names or strings, but inside the select() function
you can use it to specify a range of variable names.
You can also omit variables using the select() function by using the negative sign. With select()
you can do

In [49]:
select(chicago, -(city:dptp))

     date       pm25tmean2 pm10tmean2 o3tmean2  no2tmean2
1    1987-01-01 NA         34.00000    4.250000 19.98810
2    1987-01-02 NA               NA    3.304348 23.19099
3    1987-01-03 NA         34.16667    3.333333 23.81548
4    1987-01-04 NA         47.00000    4.375000 30.43452
5    1987-01-05 NA               NA    4.750000 30.33333
6    1987-01-06 NA         48.00000    5.833333 25.77233
7    1987-01-07 NA         41.00000    9.291667 20.58171
8    1987-01-08 NA         36.00000   11.291667 17.03723
9    1987-01-09 NA         33.28571    4.500000 23.38889
10   1987-01-10 NA               NA    4.958333 19.54167
11   1987-01-11 NA         22.00000   17.541667 13.70139
12   1987-01-12 NA         26.00000    8.000000 33.02083
13   1987-01-13 NA         53.00000    4.958333 38.06142
14   1987-01-14 NA         43.00000    4.208333 32.19444
15   1987-01-15 NA         28.83333    4.458333 18.87131
16   1987-01-16 NA         19.00000    7.916667 19.46667
17   1987-01-17 NA               NA    5.833333 20.70833
18   1987-01-18 NA         39.00000    6.375000 21.03333
19   1987-01-19 NA         32.00000   14.875000 17.17409
20   1987-01-20 NA         38.00000    7.250000 21.61021
21   1987-01-21 NA         32.85714    8.913043 24.52083
22   1987-01-22 NA         52.00000   10.500000 16.98798
23   1987-01-23 NA         55.00000   14.625000 14.66250
24   1987-01-24 NA         38.00000   10.083333 18.69167
25   1987-01-25 NA               NA    6.666667 26.30417
26   1987-01-26 NA         71.00000    4.583333 32.42143
27   1987-01-27 NA         39.33333    6.000000 30.69306
28   1987-01-28 NA         47.00000    6.875000 29.12943
29   1987-01-29 NA         35.00000    2.916667 28.14529
30   1987-01-30 NA         59.00000    8.791667 19.79861
...  ...        ...        ...        ...       ...
6911 2005-12-02       NA   19.50       9.156250 23.29167
6912 2005-12-03 13.34286   20.00      10.333333 25.19444
6913 2005-12-04 15.30000   15.50      13.177083 21.70833
6914 2005-12-05       NA   30.00       6.447917 28.38889
6915 2005-12-06 24.61667   33.00       4.701540 29.08333
6916 2005-12-07 37.80000   39.00       3.916214 34.30952
6917 2005-12-08 24.30000   31.00       5.995265 34.22222
6918 2005-12-09 25.45000   22.00       5.958333 31.41667
6919 2005-12-10 18.20000   30.00       9.135417 28.70833
6920 2005-12-11 10.60000   14.00      11.333333 22.55556
6921 2005-12-12 19.22500   28.75       5.031250 39.74621
6922 2005-12-13 26.50000   21.00       6.628623 29.56944
6923 2005-12-14 26.90000   16.00       3.802083 30.63384
6924 2005-12-15 14.40000   16.50       4.895833 25.43056
6925 2005-12-16 11.00000   22.00      11.166667 16.87500
6926 2005-12-17 13.80000   20.00       8.593750 20.73611
6927 2005-12-18 12.20000   17.50      13.552083 19.11111
6928 2005-12-19 21.15000   21.00       8.058877 31.79167
6929 2005-12-20 25.75000   32.00       3.849185 32.89773
6930 2005-12-21 37.92857   59.50       3.663949 34.86111
6931 2005-12-22 36.65000   42.50       5.385417 33.73026
6932 2005-12-23 32.90000   34.50       6.906250 29.08333
6933 2005-12-24 30.77143   25.20       1.770833 31.98611
6934 2005-12-25  6.70000    8.00      14.354167 13.79167
6935 2005-12-26  8.40000    8.50      14.041667 16.81944
6936 2005-12-27 23.56000   27.00       4.468750 23.50000
6937 2005-12-28 17.75000   27.50       3.260417 19.28563
6938 2005-12-29  7.45000   23.50       6.794837 19.97222
6939 2005-12-30 15.05714   19.20       3.034420 22.80556
6940 2005-12-31 15.00000   23.50       2.531250 13.25000

The select() function also allows a special syntax that allows you to specify variable names based
on patterns. So, for example, if you wanted to keep every variable that ends with a “2”, we could do

In [50]:
# selecting variables which end with 2
subset <- select(chicago, ends_with("2"))
str(subset)

'data.frame':	6940 obs. of  4 variables:
 $ pm25tmean2: num  NA NA NA NA NA NA NA NA NA NA ...
 $ pm10tmean2: num  34 NA 34.2 47 NA ...
 $ o3tmean2  : num  4.25 3.3 3.33 4.38 4.75 ...
 $ no2tmean2 : num  20 23.2 23.8 30.4 30.3 ...

### Filter()

The filter() function is used to extract subsets of rows from a data frame. This function is similar
to the existing subset() function in R but is quite a bit faster in my experience.
Suppose we wanted to extract the rows of the chicago data frame where the levels of PM2.5 are
greater than 30 (which is a reasonably high level), we could do

In [52]:
# select those where mean is > 30
chic.f <- filter(chicago, pm25tmean2 > 30)
str(chic.f)

'data.frame':	194 obs. of  8 variables:
 $ city      : chr  "chic" "chic" "chic" "chic" ...
 $ tmpd      : num  23 28 55 59 57 57 75 61 73 78 ...
 $ dptp      : num  21.9 25.8 51.3 53.7 52 56 65.8 59 60.3 67.1 ...
 $ date      : Date, format: "1998-01-17" "1998-01-23" ...
 $ pm25tmean2: num  38.1 34 39.4 35.4 33.3 ...
 $ pm10tmean2: num  32.5 38.7 34 28.5 35 ...
 $ o3tmean2  : num  3.18 1.75 10.79 14.3 20.66 ...
 $ no2tmean2 : num  25.3 29.4 25.3 31.4 26.8 ...

In [57]:
summary(chic.f$pm25tmean2)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  30.05   32.12   35.04   36.63   39.53   61.50

We can place an arbitrarily complex logical sequence inside of filter(), so we could for example
extract the rows where PM2.5 is greater than 30 and temperature is greater than 80 degrees
Fahrenheit.

In [61]:
chic.f <- filter(chicago, pm25tmean2>30 & tmpd>80)
select(chic.f, date, tmpd, pm25tmean2)

   date       tmpd pm25tmean2
1  1998-08-23 81   39.60000
2  1998-09-06 81   31.50000
3  2001-07-20 82   32.30000
4  2001-08-01 84   43.70000
5  2001-08-08 85   38.83750
6  2001-08-09 84   38.20000
7  2002-06-20 82   33.00000
8  2002-06-23 82   42.50000
9  2002-07-08 81   33.10000
10 2002-07-18 82   38.85000
11 2003-06-25 82   33.90000
12 2003-07-04 84   32.90000
13 2005-06-24 86   31.85714
14 2005-06-27 82   51.53750
15 2005-06-28 85   31.20000
16 2005-07-17 84   32.70000
17 2005-08-03 84   37.90000

### arrange()

The arrange() function is used to reorder rows of a data frame according to one of the variables/columns.
Reordering rows of a data frame (while preserving corresponding order of other columns)
is normally a pain to do in R. The arrange() function simplifies the process quite a bit.
Here we can order the rows of the data frame by date, so that the first row is the earliest (oldest)
observation and the last row is the latest (most recent) observation.

In [62]:
# arranging by date and selecting first 3 rows
chicago <- arrange(chicago, date)
head(select(chicago, date, pm25tmean2), 3)

  date       pm25tmean2
1 1987-01-01 NA
2 1987-01-02 NA
3 1987-01-03 NA

### rename()
Renaming a variable in a data frame in R is surprisingly hard to do! The rename() function designed to make this process easier.
Here you can see the names of the first five variables in the chicago data frame.

In [63]:
head(chicago[ ,1:5],3)

  city tmpd dptp   date       pm25tmean2
1 chic 31.5 31.500 1987-01-01 NA
2 chic 33.0 29.875 1987-01-02 NA
3 chic 33.0 27.375 1987-01-03 NA

In [64]:
chicago <- rename(chicago, dewpoint=dptp, pm25 = pm25tmean2)
head(chicago[ ,1:5],3)

  city tmpd dewpoint date       pm25
1 chic 31.5 31.500   1987-01-01 NA
2 chic 33.0 29.875   1987-01-02 NA
3 chic 33.0 27.375   1987-01-03 NA

The syntax inside the rename() function is to have the new name on the left-hand side of the = sign
and the old name on the right-hand side.

### mutate()
The mutate() function exists to compute transformations of variables in a data frame. Often, you
want to create new variables that are derived from existing variables and mutate() provides a clean
interface for doing that.
For example, with air pollution data, we often want to detrend the data by subtracting the mean
from the data. That way we can look at whether a given day’s air pollution level is higher than or
less than average (as opposed to looking at its absolute level).
Here we create a pm25detrend variable that subtracts the mean from the pm25 variable.

In [72]:
chicago <- mutate(chicago, pm25detrend = pm25 - mean(pm25, na.rm=TRUE))
head(chicago)

  city tmpd dewpoint date       pm25 pm10tmean2 o3tmean2 no2tmean2 pm25detrend
1 chic 31.5 31.500   1987-01-01 NA   34.00000   4.250000 19.98810  NA
2 chic 33.0 29.875   1987-01-02 NA         NA   3.304348 23.19099  NA
3 chic 33.0 27.375   1987-01-03 NA   34.16667   3.333333 23.81548  NA
4 chic 29.0 28.625   1987-01-04 NA   47.00000   4.375000 30.43452  NA
5 chic 32.0 28.875   1987-01-05 NA         NA   4.750000 30.33333  NA
6 chic 40.0 35.125   1987-01-06 NA   48.00000   5.833333 25.77233  NA

### group_by()
The group_by() function is used to generate summary statistics from the data frame within strata
defined by a variable. For example, in this air pollution dataset, you might want to know what the
average annual level of PM2.5 is. So the stratum is the year, and that is something we can derive
from the date variable. In conjunction with the group_by() function we often use the summarize()
function (or summarise() for some parts of the world).
The general operation here is a combination of splitting a data frame into separate pieces defined by
a variable or group of variables (group_by()), and then applying a summary function across those
subsets (summarize()).
First, we can create a year varible using as.POSIXlt().

In [74]:
chicago <- mutate(chicago, year=as.POSIXlt(date)$year + 1900)

years <- group_by(chicago, year)

In [79]:

summarize(years, pm25 = mean(pm25, na.rm=TRUE), o3 = max(o3tmean2, na.rm=TRUE), n02 = median(no2tmean2, na.rm=TRUE))

   year pm25     o3       n02
1  1987      NaN 62.96966 23.49369
2  1988      NaN 61.67708 24.52296
3  1989      NaN 59.72727 26.14062
4  1990      NaN 52.22917 22.59583
5  1991      NaN 63.10417 21.38194
6  1992      NaN 50.82870 24.78921
7  1993      NaN 44.30093 25.76993
8  1994      NaN 52.17844 28.47500
9  1995      NaN 66.58750 27.26042
10 1996      NaN 58.39583 26.38715
11 1997      NaN 56.54167 25.48143
12 1998 18.26467 50.66250 24.58649
13 1999 18.49646 57.48864 24.66667
14 2000 16.93806 55.76103 23.46082
15 2001 16.92632 51.81984 25.06522
16 2002 15.27335 54.88043 22.73750
17 2003 15.23183 56.16608 24.62500
18 2004 14.62864 44.48240 23.39130
19 2005 16.18556 58.84126 22.62387

### %>% Pipeline operator
The pipeline operater %>% is very handy for stringing together multiple dplyr functions in a sequence
of operations. Notice above that every time we wanted to apply more than one function, the sequence
gets buried in a sequence of nested function calls that is difficult to read, i.e.

#### first(x) %>% second(x) %>% third(x)
Another example might be computing the average pollutant level by month. This could be useful to
see if there are any seasonal trends in the data.

In [81]:
mutate(chicago, month = as.POSIXlt(date)$mon + 1) %>% group_by(month) %>% summarize(
pm25 = mean(pm25, na.rm=TRUE), o3=max(o3tmean2, na.rm=TRUE), no2=median(no2tmean2, na.rm=TRUE))

   month pm25     o3       no2
1   1    17.76996 28.22222 25.35417
2   2    20.37513 37.37500 26.78034
3   3    17.40818 39.05000 26.76984
4   4    13.85879 47.94907 25.03125
5   5    14.07420 52.75000 24.22222
6   6    15.86461 66.58750 25.01140
7   7    16.57087 59.54167 22.38442
8   8    16.93380 53.96701 22.98333
9   9    15.91279 57.48864 24.47917
10 10    14.23557 47.09275 24.15217
11 11    15.15794 29.45833 23.56537
12 12    17.52221 27.70833 24.45773

### Summary 
The dplyr package provides a concise set of operations for managing data frames. With these
functions we can do a number of complex operations in just a few lines of code. In particular,
we can often conduct the beginnings of an exploratory analysis with the powerful combination of
group_by() and summarize().
Once you learn the dplyr grammar there are a few additional benefits
1. dplyr can work with other data frame “backends” such as SQL databases. There is an SQL
interface for relational databases via the DBI package
2. dplyr can be integrated with the data.table package for large fast tables
The dplyr package is handy way to both simplify and speed up your data frame management code.
It’s rare that you get such a combination at the same time!